In [1]:
import sqlpandas 
from pandasql import sqldf

In [2]:
import pandas as pd
import numpy as np

df_sales = pd.DataFrame([
                        [1, 'Sale1', 1],
                        [2, 'Sale2', 2],
                        [3, 'Sale3', np.nan],         
                        [4, 'Sale4', 1]
                        ],
              columns=['ID', 'Sale_LB', 'Customer_ID'])

df_customer = pd.DataFrame([
                        [1, 'Customer A', '123 Street', np.nan],
                        [2, 'Customer B', '444 Street', '333 Street'],
                        [3, 'Customer C', '444 Street', '666 Street']
                        ], 
                columns=['ID', 'Customer', 'Billing Address', 'Shipping Address'])

In [3]:
sqldf("select * from df_customer", globals())

   ID    Customer Billing Address Shipping Address
0   1  Customer A      123 Street             None
1   2  Customer B      444 Street       333 Street
2   3  Customer C      444 Street       666 Street

In [5]:
%%sql
SELECT * FROM df_customer
where ID = 1

   ID    Customer Billing Address Shipping Address
0   1  Customer A      123 Street             None

In [5]:
%%sql
select count(1) as nb_sales
FROM df_sales

   nb_sales
0         4

In [6]:
%%sql
select Customer, count(1) as nb_sales
FROM df_sales
inner join df_customer
on df_sales.Customer_ID = df_customer.ID
group by Customer

     Customer  nb_sales
0  Customer A         2
1  Customer B         1

In [7]:
result_df = %sql select count(1) as nb_sales FROM df_sales

In [8]:
result_df

   nb_sales
0         4

In [6]:
%%sql res_df 
select Customer, count(1) as nb_sales
FROM df_sales
inner join df_customer
on df_sales.Customer_ID = df_customer.ID
group by Customer

     Customer  nb_sales
0  Customer A         2
1  Customer B         1

In [7]:
res_df

     Customer  nb_sales
0  Customer A         2
1  Customer B         1